const stnData = [
  {
    stnId: 1,
    stnKo: '속초',
    lat : 38.16562012062636,
    lon : 128.593788109193
  },
  {
    stnId: 2,
    stnKo: '이천',
    lat : 37.208743395334565,
    lon : 127.48020648055358
  },
  {
    stnId: 3,
    stnKo: '서울',
    lat : 37.49365642185235,
    lon : 126.91703930447107
  },
  {
    stnId: 4,
    stnKo: '대전',
    lat : 36.306487400960194,
    lon : 127.42195103216802
  },
  {
    stnId: 5,
    stnKo: '대구',
    lat : 35.79278479210015,
    lon : 128.57734642389119
  },
  {
    stnId: 6,
    stnKo: '부산',
    lat : 35.12661683969977,
    lon : 129.07661411293668
  },
  {
    stnId: 7,
    stnKo: '광주',
    lat : 35.119627859120904,
    lon : 126.85371386396587
  },
  {
    stnId: 8,
    stnKo: '해남',
    lat : 34.533429744197846,
    lon : 126.61750782729942 
  },
  {
    stnId: 9,
    stnKo: '제주',
    lat : 33.338560334015,
    lon : 126.5188593587606
  },
  {
    stnId: 10,
    stnKo: '울릉',
    lat : 37.483087962280614,
    lon : 130.9014236895887
  },
  {
    stnId: 11,
    stnKo: '포천',
    lat : 37.972164, 
    lon : 127.249262
  },
  {
	    stnId: 12,
	    stnKo: '예천',
	    lat : 36.661274, 
	    lon : 128.415969
	  },
	  {
		  stnId: 13,
		  stnKo: '수원',
		  lat : 37.290222,  
		  lon : 127.001891
	  },
	  {
		  stnId: 14,
		  stnKo: '당진',
		  lat : 36.916166,   
		  lon : 126.641795
	  },
	  {
		  stnId: 15,
		  stnKo: '종로5가',
		  lat : 37.571019,    
		  lon : 127.001905
	  },
	  {
		  stnId: 16,
		  stnKo: '합정',
		  lat : 37.550004,     
		  lon : 126.914359
	  },
]